<?php

return[
    'lesson' => [
        'title' => 'درس',
        'plural' => 'دروس',
        'create' => 'إنشاء درس جديد',
        'edit' => 'تعديل درس',
        'view' => 'عرض درس',
        'delete' => 'حذف درس',
        'deleted' => 'تم حذف الدرس بنجاح',
        'created' => 'تم إنشاء الدرس بنجاح',
        'updated' => 'تم تحديث الدرس بنجاح',
    ],
    'student'=>[
        'title' => 'طالب',
        'plural' => 'طلاب',
        'create' => 'إنشاء طالب جديد',
        'edit' => 'تعديل طالب', 
        'view' => 'عرض طالب',
        'delete' => 'حذف طالب',
        'deleted' => 'تم حذف الطالب بنجاح',
        'created' => 'تم إنشاء الطالب بنجاح',
        'updated' => 'تم تحديث الطالب بنجاح',

    ],
    'start_time' => 'وقت البدء',
    'end_time' => 'وقت الانتهاء',
    'type' => 'نوع الدرس',
    'teacher' => [
        'title' => 'معلم',
        'plural' => 'معلمون',
        'create' => 'إنشاء معلم جديد',
        'edit' => 'تعديل معلم',
        'view' => 'عرض معلم',
        'delete' => 'حذف معلم',
        'deleted' => 'تم حذف المعلم بنجاح',
        'created' => 'تم إنشاء المعلم بنجاح',
        'updated' => 'تم تحديث المعلم بنجاح',
    ],
    'group' => [
        'title' => 'مجموعة',
        'plural' => 'مجموعات',
        'create' => 'إنشاء مجموعة جديدة',
        'edit' => 'تعديل مجموعة',
        'view' => 'عرض مجموعة',
        'delete' => 'حذف مجموعة',
        'deleted' => 'تم حذف المجموعة بنجاح',
        'created' => 'تم إنشاء المجموعة بنجاح',
        'updated' => 'تم تحديث المجموعة بنجاح',
    ],

    'user' => [
        'title' => 'مستخدم',
        'plural' => 'مستخدمون',
        'create' => 'إنشاء مستخدم جديد',
        'edit' => 'تعديل مستخدم',
        'view' => 'عرض مستخدم',
        'delete' => 'حذف مستخدم',
        'deleted' => 'تم حذف المستخدم بنجاح',
        'created' => 'تم إنشاء المستخدم بنجاح',
        'updated' => 'تم تحديث المستخدم بنجاح',
    ],


    // Add other translations as needed
];